layui.define(['laytpl', 'jquery'], function (exports) {
    var laytpl = layui.laytpl;
    var $ = layui.jquery;
    // 选项卡1数据
    var data = {
        'title': 'newsList',
        'list': [
            {
                'title': '你可钓过麻虾',
                'detail': '笨虾，固始人叫麻虾，小时候池塘里全是，午后转塘埂，清澈的池塘边上就趴有一些，我趴下去，猛的一抓，它用力一弹就跑了，总有一些懊恼。   大家都一',
                'imgSrc': './img/news_item.png',
                'source': '海鲜网',
                'time': '2018-10-29',
                'mark': '海鲜知识'
            },
            {
                'title': '【滋味】虾这么做，连壳都不用剥！',
                'detail': '笨虾，固始人叫麻虾，小时候池塘里全是，午后转塘埂，清澈的池塘边上就趴有一些，我趴下去，猛的一抓，它用力一弹就跑了，总有一些懊恼。   大家都一',
                'imgSrc': './img/news_item1.png',
                'source': '海鲜网',
                'time': '2018-09-26',
                'mark': '海鲜知识'
            },
            {
                'title': '你真的会吃螃蟹？这四个部位万万不能吃！',
                'detail': '9月，稻将熟、蟹长肥，又到吃大闸蟹的季节啦！不过，大闸蟹味虽美，但其实食用是有一定讲究的，甚至有些部位是不能吃的！真正的行家 这样吃...',
                'imgSrc': './img/news_item2.png',
                'source': '海鲜网',
                'time': '2018-09-26',
                'mark': '海鲜知识'
            },
            {
                'title': '螃蟹肚子要朝上，蛤蜊不能加水煮…秋季吃海鲜原来有这么多禁忌',
                'detail': '小王子虽然是土生土长的西安妹子 但是对海鲜却有着蜜汁热爱 美味当前一不留神就容易贪吃 之前就有人因吃海鲜喝啤酒出现痛风症状 引发脚趾红肿，还...',
                'imgSrc': './img/news_item3.png',
                'source': '海鲜网',
                'time': '2018-09-26',
                'mark': '吃货攻略'
            },
            {
                'title': '肉嫩汁浓，食欲满满的虾是这样做出来滴',
                'detail': '鲜嫩的虾肉沾染了些许啤酒的麦芽儿香之后，香气和质感都飞跃了一个档次，香气扑鼻，爽口异常，吃起来不由得大呼过瘾。 啤酒金钱虾 材料： 青虾400克，...',
                'imgSrc': './img/news_item4.png',
                'source': '海鲜网',
                'time': '2018-09-13',
                'mark': '吃货攻略'
            },
            {
                'title': '广东常见海鱼品种',
                'detail': '欢迎大家参与增加，有不对的请指正   黑棘鲷，又称黑鲷，海钓最常见的目标鱼，俗名乌格、黑格、厚唇、海鲋、青鳞加吉、青郎、乌颊、牛屎鱲、乌翅、黑...',
                'imgSrc': './img/news_item5.png',
                'source': '海鲜网',
                'time': '2018-09-11',
                'mark': '海鲜知识'
            },
            {
                'title': '海鱼比河鱼好？真相可能跟你想的不一样',
                'detail': '较真鉴定 不论是从营养角度，还是安全角度，海鱼都并不一定比河鱼好，海鱼和河鱼都是好鱼，没有太大差异。 查证者：阮光锋，食品与营养信息交流中心科...',
                'imgSrc': './img/news_item6.png',
                'source': '海鲜网',
                'time': '2018-09-11',
                'mark': '海鲜知识'
            },
            {
                'title': '黄花鱼的终极做法，鲜嫩的要流口水~',
                'detail': '俗话说，靠山吃山，靠海吃海。厦门作为一个沿海的城市，自然吃的海鲜要比大米多的多。   但是不管是什么海鲜，做法万变不离其中，讲究的就是一...',
                'imgSrc': './img/news_item7.png',
                'source': '海鲜网',
                'time': '2018-09-03',
                'mark': '吃货攻略'
            },
            {
                'title': '蒜香花甲螺，一颗一口鲜！',
                'detail': '波纹巴非蛤你听说过吗？其实它就是咱们经常吃的花甲螺！它是高蛋白、低脂肪的健康食品，能抑制胆固醇形成，而且味道非常鲜美，深受吃货喜爱！现在正是...',
                'imgSrc': './img/news_item8.png',
                'source': '海鲜网',
                'time': '2018-09-03',
                'mark': '吃货攻略'
            },
            {
                'title': '开背虾的做法',
                'detail': '虾的做法多种多样，并且是老少皆宜，深受人们喜爱的美味之一。以下是开背虾的做法，欢迎阅读。   清蒸开背虾的做法   清蒸开背虾的主料...',
                'imgSrc': './img/news_item9.png',
                'source': '海鲜网',
                'time': '2018-09-02',
                'mark': '海鲜知识'
            },
        ]
    };
    var getTpl = $('#leftNewsItem').html();
    /**
     * 通过模板引擎 数据传入到模板中渲染
     */
    laytpl(getTpl).render(data, function (html) {
        $('#leftNewBox').html(html);
    });
    exports('newsListTpl', {});
});